#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<pre>terraform
module.thadmin_routing.module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:627002765486:certificate/565d3a00-d047-48f2-956a-aed08dd6956b]
module.thadmin_routing.module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket"]: Refreshing state... [id=E3JOC36ODMBL65]
module.thadmin_hosting.aws_s3_bucket.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.acm.aws_route53_record.validation["thadmin-staging.technicie.nl"]: Refreshing state... [id=Z3I4ZHBBD5NSHU__f4c1968cf0da5157d0f46ed63ecf426e.thadmin-staging.technicie.nl._CNAME]
module.thadmin_routing.module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2022-03-15 04:55:50.004 +0000 UTC]
module.thadmin_hosting.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_hosting.aws_s3_bucket_acl.this: Refreshing state... [id=thalia-thadmin-staging,private]
module.thadmin_routing.module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2ZP8HCBLISQFN]
module.thadmin_routing.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.aws_route53_record.api: Refreshing state... [id=Z3I4ZHBBD5NSHU_thadmin-staging_A]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2436-1125.jpg"]: Refreshing state... [id=apple-splash-2436-1125.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1620-2160.jpg"]: Refreshing state... [id=apple-splash-1620-2160.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["browserconfig.xml"]: Refreshing state... [id=browserconfig.xml]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-1536.jpg"]: Refreshing state... [id=apple-splash-2048-1536.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-640-1136.jpg"]: Refreshing state... [id=apple-splash-640-1136.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["site.webmanifest"]: Refreshing state... [id=site.webmanifest]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-144x144.png"]: Refreshing state... [id=mstile-144x144.png]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.svg"]: Refreshing state... [id=favicon.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1792-828.jpg"]: Refreshing state... [id=apple-splash-1792-828.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/525.097a0083.js.map"]: Refreshing state... [id=js/525.097a0083.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"]: Refreshing state... [id=img/backgroundImage.24f22a44.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-70x70.png"]: Refreshing state... [id=mstile-70x70.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2732-2048.jpg"]: Refreshing state... [id=apple-splash-2732-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/525.097a0083.js"]: Refreshing state... [id=js/525.097a0083.js]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.fa082765.js.map"]: Refreshing state... [id=js/app.fa082765.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1170-2532.jpg"]: Refreshing state... [id=apple-splash-1170-2532.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["safari-pinned-tab.svg"]: Refreshing state... [id=safari-pinned-tab.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2688-1242.jpg"]: Refreshing state... [id=apple-splash-2688-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1284-2778.jpg"]: Refreshing state... [id=apple-splash-1284-2778.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1125-2436.jpg"]: Refreshing state... [id=apple-splash-1125-2436.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.02b7c0c4.js"]: Refreshing state... [id=js/chunk-vendors.02b7c0c4.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-touch-icon.png"]: Refreshing state... [id=apple-touch-icon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["index.html"]: Refreshing state... [id=index.html]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1334-750.jpg"]: Refreshing state... [id=apple-splash-1334-750.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-512x512.png"]: Refreshing state... [id=android-chrome-512x512.png]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-150x150.png"]: Refreshing state... [id=mstile-150x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x310.png"]: Refreshing state... [id=mstile-310x310.png]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1136-640.jpg"]: Refreshing state... [id=apple-splash-1136-640.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2532-1170.jpg"]: Refreshing state... [id=apple-splash-2532-1170.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2688.jpg"]: Refreshing state... [id=apple-splash-1242-2688.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2778-1284.jpg"]: Refreshing state... [id=apple-splash-2778-1284.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2388.jpg"]: Refreshing state... [id=apple-splash-1668-2388.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["css/app.5b725460.css"]: Refreshing state... [id=css/app.5b725460.css]
module.thadmin_hosting.aws_s3_object.code_build_object["img/anonymousUser.c7a94bce.jpg"]: Refreshing state... [id=img/anonymousUser.c7a94bce.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2388-1668.jpg"]: Refreshing state... [id=apple-splash-2388-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2208.jpg"]: Refreshing state... [id=apple-splash-1242-2208.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2224-1668.jpg"]: Refreshing state... [id=apple-splash-2224-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.png"]: Refreshing state... [id=favicon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-828-1792.jpg"]: Refreshing state... [id=apple-splash-828-1792.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1536-2048.jpg"]: Refreshing state... [id=apple-splash-1536-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.02b7c0c4.js.map"]: Refreshing state... [id=js/chunk-vendors.02b7c0c4.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["css/chunk-vendors.de32ab32.css"]: Refreshing state... [id=css/chunk-vendors.de32ab32.css]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x150.png"]: Refreshing state... [id=mstile-310x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2160-1620.jpg"]: Refreshing state... [id=apple-splash-2160-1620.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.fa082765.js"]: Refreshing state... [id=js/app.fa082765.js]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-192x192.png"]: Refreshing state... [id=android-chrome-192x192.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2208-1242.jpg"]: Refreshing state... [id=apple-splash-2208-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-750-1334.jpg"]: Refreshing state... [id=apple-splash-750-1334.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2224.jpg"]: Refreshing state... [id=apple-splash-1668-2224.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-2732.jpg"]: Refreshing state... [id=apple-splash-2048-2732.jpg]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag                   = "407e69540c950ce3e893be2cbadd0f30-2" -> "5f59aad8b5eddf226c7e5a21939e4018"
        id                     = "img/backgroundImage.24f22a44.jpg"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag                   = "7003218cbfb96769c2a494e908c07728" -> "0227f195c9e4c09dfc567c1d3af26bb9"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525.097a0083.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "3dbe8269cbf544fee50b566052550c89" -> null
      - force_destroy          = false -> null
      - id                     = "js/525.097a0083.js" -> null
      - key                    = "js/525.097a0083.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525.097a0083.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525.097a0083.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "49857939edee7a0d0fd7317bc9524486" -> null
      - force_destroy          = false -> null
      - id                     = "js/525.097a0083.js.map" -> null
      - key                    = "js/525.097a0083.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525.097a0083.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525.5b4ba57e.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "41a9d7f48b90ae795fae5a97ef33147c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/525.5b4ba57e.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525.5b4ba57e.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525.5b4ba57e.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "644b0e2cac414cdd6ae4cff52ccb398c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/525.5b4ba57e.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525.5b4ba57e.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.126d3c9c.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "0c27faa7977ac967461d46cf58dba822"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.126d3c9c.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.126d3c9c.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.126d3c9c.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "3e673d5abb16f79507e064b0719ab4f5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.126d3c9c.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.126d3c9c.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.fa082765.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "07cf39cb82cbee01a67621792be15033" -> null
      - force_destroy          = false -> null
      - id                     = "js/app.fa082765.js" -> null
      - key                    = "js/app.fa082765.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.fa082765.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.fa082765.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "312d581cc65b4c1d8c1072693d0f144d" -> null
      - force_destroy          = false -> null
      - id                     = "js/app.fa082765.js.map" -> null
      - key                    = "js/app.fa082765.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.fa082765.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.02b7c0c4.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "2f0ae323b8727709b996e6f2c40b1c8c" -> null
      - force_destroy          = false -> null
      - id                     = "js/chunk-vendors.02b7c0c4.js" -> null
      - key                    = "js/chunk-vendors.02b7c0c4.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.02b7c0c4.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.02b7c0c4.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "9f15b184398246bbc5f787d5e2f28110" -> null
      - force_destroy          = false -> null
      - id                     = "js/chunk-vendors.02b7c0c4.js.map" -> null
      - key                    = "js/chunk-vendors.02b7c0c4.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.02b7c0c4.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.dbd7af7e.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "4624f8223473ba30ada2cf72af41fe0e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.dbd7af7e.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.dbd7af7e.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.dbd7af7e.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "14819af869ec2655bd33b1bd53d4f452"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.dbd7af7e.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.dbd7af7e.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 6 to add, 2 to change, 6 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_profile" but a value
was found in file "terraform.tfvars". To use this value, add a "variable"
block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

</pre>
</details>